Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: འདིས་དེར་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱད་དེ་དབང་པོ་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱས་པ་དེས་ན། ད་ལྟར་རྣམ་པར་གྲོལ་བར་གྱུར་ཏོ།། །།
en: After practicing pure conduct all his life then, his faculties ripened, and now he has been liberated.”

source: རི་དགས་ཀྱི་བརྟུལ་ཞུགས་ཅན་ཞེས་བྱ་བ་ནི།
en: The Mṛgavratins

source: གླེང་གཞི་རྒྱལ་པོའི་ཁབ་ན་བཞུགས་ཏེ། དེའི་ཚེ་ཡུལ་བི་དེ་ཧའི་ལྗོངས་ཀྱི་རི་དགས་ཀྱི་བརྟུལ་ཞུགས་ཅན་རི་དགས་ཀྱི་པགས་པ་གྱོན་ཞིང་རྭ་ཐོགས་པ། རི་དགས་རྣམས་དང་ལྷན་ཅིག་ཏུ་རྩྭ་ཟ་ཞིང་ཆུ་འཐུང་བ་ལྔ་བརྒྱ་ཙམ་ཞིག་འཁོད་དོ། །
en: When the Blessed One was in Rājagṛha, the Mṛgavratins of the province of Videha, a group of ascetics who took vows to live as deer, were living in the company of some five hundred deer, draped in deerskin and wearing horns, eating grass, and drinking water.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་བགྲོད་པ་གཅིག་པུའི་ལམ་སྟོན་པ། རྣམ་པ་གཉིས་ཀྱི་ཤེས་བྱ་དང་ཡེ་ཤེས་ལ་མངའ་བརྙེས་པ། མ་འདྲེས་པའི་དྲན་པ་ཉེ་བར་གཞག་པ་གསུམ་ལ་མཁས་པ། མི་འཇིགས་པ་བཞིས་མི་འཇིགས་པ་འགྲོ་བ་ལྔར་འགྲོ་བ་ལས་རྣམ་པར་གྲོལ་བ། སྐྱེ་མཆེད་དྲུག་ལ་མཁས་པ། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་ལ་སྤྱོད་ཡུལ་བ། རྣམ་པར་ཐར་པ་བརྒྱད་ལ་བསམ་གཏན་པ། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་ལ་སྙོམས་པར་འཇུག་པ། སྟོབས་བཅུའི་སྟོབས་དང་ལྡན་པ། ཡང་དག་པའི་སེང་གེའི་སྒྲ་ཆེན་པོ་སྒྲོགས་པ་རྣམས་ནི། ཆོས་ཉིད་ཀྱིས་ཉིན་དུས་གསུམ་མཚན་དུས་གསུམ་སྟེ། ཉིན་མཚན་དུས་དྲུག་ཏུ་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་འཇིག་རྟེན་ལ་གཟིགས་ཏེ།
en: The blessed buddhas, teachers of the one path to be traversed, with mastery over wisdom and the two types of knowable objects, in command of the three kinds of sterling equanimity, fearless by means of the fourfold fearlessness, freed from migration through the five destinies, keen in the six sense bases, practiced in the seven limbs of enlightenment, focused on the eight liberations, absorbed in the nine successive meditative absorptions, possessing all ten of the ten powers, whose proclamations are the great roaring of a perfect lion, by nature regard the world with their buddha eyes six times throughout the day and night—three times by day and three times by night. These are their thoughts as they look out in wisdom:

source: རི་དགས་ཀྱི་བརྟུལ་ཞུགས་ཅན་ལྔ་བརྒྱ་པོ་རྣམས་གདུལ་བའི་དུས་ལ་བབ་བོ་སྙམ་དུ་དགོངས་ནས།
en: “The time has come to tame these five hundred Mṛgavratins.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཅི་ནས་རི་དགས་ཀྱི་བརྟུལ་ཞུགས་ཅན་དེ་རྣམས་ཀྱིས་རི་དགས་དེ་དག་རྒྱལ་པོའི་ཁབ་ཏུ་འགྲོ་བར་མཐོང་ལ།
en: So the Blessed One performed a miracle that caused the Mṛgavratins to see the deer headed to Rājagṛha,

source: མཐོང་ནས་དེ་རྣམས་ཀྱང་རི་དགས་དེ་དག་དང་ལྷན་ཅིག་ཏུ་རྒྱལ་པོའི་ཁབ་ཏུ་འགྲོ་བར་འགྱུར་བ་དེ་ལྟ་བུར་བྱིན་གྱིས་བརླབས་སོ། །
en: and having seen the deer, to travel with them to Rājagṛha.

source: དེ་ནས་དེ་དག་དེར་སོང་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་སྤྲུལ་པའི་རི་དགས་དེ་དག་མི་སྣང་བར་བྱས་སོ། །
en: After they had done so, the deer that the Blessed One had emanated disappeared.

source: དེ་ནས་སྐྱེ་བོ་ཕལ་པོ་ཆེ་དེ་དག་གིས་དེ་རྣམས་མཐོང་ནས་རྣམ་པར་སྨོད་པར་བྱེད་དོ། །
en: A great crowd of people caught sight of them and began to mock them,

source: དེ་ལྟར་སྨད་ནས་དེ་རྣམས་རྒྱལ་པོའི་ཁབ་ནས་བྱུང་སྟེ། འོད་མའི་ཚལ་ལོགས་སུ་ཆས་སོ། །
en: and since they were being mocked, they left Rājagṛha and traveled to Bamboo Grove.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་རྣམས་ལ་ཐུགས་བརྩེ་བའི་ཕྱིར་མདུན་དུ་བཞུགས་སོ། །
en: Out of compassion for them, the Blessed One then took a seat facing them.

source: དེ་ནས་རི་དགས་ཀྱི་བརྟུལ་ཞུགས་ཅན་ལྔ་བརྒྱ་པོ་དེ་དག་གིས་ཐག་རིང་པོ་ཞིག་ནས་བཅོམ་ལྡན་འདས་མཐོང་ངོ་། །མཐོང་ནས་ཀྱང་དེ་དག་བཅོམ་ལྡན་འདས་ལ་དགའ་བར་གྱུར་ཏོ། །
en: The Mṛgavratins saw the Blessed One from a distance, and at the sight of the Blessed One, they felt joy toward him.

source: དགའ་བར་གྱུར་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བཞུགས་པ་དེར་དོང་སྟེ་ལྷགས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: In their joy they approached the Blessed One, touched their heads to his feet,

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་རྣམས་ཀྱི་བསམ་པ་དང་། བག་ལ་ཉལ་དང་། ཁམས་དང་ཤེས་པ་དང་། རང་བཞིན་ཐུགས་སུ་ཆུད་ནས་དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ
en: The Blessed One directly apprehended the thoughts, habitual tendencies, temperament, capacity, and nature of the five hundred Mṛgavratins and taught them the Dharma accordingly.

source: དེས་ན་རི་དགས་ཀྱི་བརྟུལ་ཞུགས་ཅན་ལྔ་བརྒྱ་པོ་དེ་དག་གིས་སྟན་དེ་ཉིད་ལ་འཁོད་བཞིན་དུ། བདེན་པ་མངོན་པར་རྟོགས་པའི་མོད་ལ་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་མངོན་སུམ་བྱས་ཏེ
en: Hearing it, they destroyed with the thunderbolt of wisdom the twenty high peaks of the mountain of views concerning the transitory collection, and manifested the resultant state of stream entry right where they sat.

source: དེ་དག་གིས་བདེན་པ་མཐོང་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: After they saw the truths, they rose from their seats, drew down the right shoulder of their upper garments, bowed toward the Blessed One with palms pressed together, and requested the Blessed One,

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་ལ་དགེ་སློང་ཚུར་ཤོག་ཅེས་བྱ་བའི་ཚིག་གིས་རབ་ཏུ་ཕྱུང་སྟེ། བསྙེན་པར་རྫོགས་པར་མཛད་ནས་དེ་དག་ལ་ལུང་ཡང་ཕོག་གོ། །
en: With the words “Come, join me, monks!” the Blessed One led them to go forth as novices, conferred on them full ordination, and instructed them.

source: དེ་དག་གིས་ཀྱང་བརྩོན་པ་དང་། བསྒྲུབ་པ་དང་འབད་པས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ། །
en: Casting away all afflictive emotions through diligence, practice, and effort, they manifested arhatship.

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་དགེ་སློང་འདི་རྣམས་ཀྱིས་ལས་ཅི་བགྱིས་ན། ལས་དེའི་རྣམ་པར་སྨིན་པས་རི་དགས་ཀྱི་ཆ་ལུགས་སུ་མཆིས་ལ་རི་དགས་རྣམས་དང་ལྷན་ཅིག་ཏུ་རྩྭ་ཟ་ཞིང་ཆུ་འཐུང་བར་གྱུར་ནས།
en: “Lord,” the monks inquired of the Blessed One, “what action did these five hundred monks take that ripened into them adopting the mannerisms of deer, eating grass and drinking water with the deer,

source: འདི་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་མཉེས་པར་བགྱིས་ཏེ། མི་མཉེས་པར་མ་བགྱིས་ལ།
en: and that they pleased the Blessed One, did not displease him,

source: བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས།
en: went forth in his doctrine,

source: ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ།
en: cast away all afflictive emotions,

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་འདི་རྣམས་ཉིད་ཀྱིས་ལས་བྱས་ཤིང་བསགས་ཏེ།
en: “These monks committed and accumulated the following actions,” the Blessed One replied.

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པ་ན། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི། ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ
en: “Monks, in times past, in this fortunate eon, when people lived as long as twenty thousand years and the tathāgata, the arhat, the totally and completely awakened buddha possessed of insight and perfect conduct, the sugata, the knower of the world, the tamer of persons, the charioteer, the unsurpassed one, the teacher of humans and gods, the blessed buddha known as Kāśyapa was in the world,

source: དེ་དགེ་སློང་གི་དགེ་འདུན་མང་པོ་དང་ཐབས་ཅིག་ཏུ་ལྗོངས་རྒྱུ་ཤིང་གཤེགས་པ་ལས། རྒྱལ་པོའི་ཁབ་ཏུ་གཤེགས་སོ། །
en: he traveled through the countryside with a great saṅgha of monks and came to Rājagṛha.

source: དེའི་ཚེ་རྒྱལ་པོའི་ཁབ་ན་དཀའ་ཐུབ་ཀྱི་གནས་ཞིག་ན་བྲམ་ཟེ་འཁོར་ལྔ་བརྒྱ་དང་ལྡན་པ་ཞིག་གནས་པ་དེས།
en: “At that time in Rājagṛha there was a certain brahmin with five hundred disciples living in a forest devoted to austerities.

source: བཅོམ་ལྡན་འདས་འོད་སྲུང་འཁོར་དང་བཅས་པ་མཐོང་ངོ་། །
en: He saw the Blessed Kāśyapa and his disciples,

source: མཐོང་ནས་ཀྱང་བྲམ་ཟེའི་ཁྱེའུ་རྣམས་ལ་སྨྲས་པ།
en: and upon seeing them he said to the young brahmins,

source: ཁྱེའུ་འོད་སྲུང་གི་དགེ་སློང་རི་དགས་བཞིན་དུ་རྒྱུ་བ་འདི་དག་ལ་ལྟོས། འདི་རྣམས་ནི་གནས་མེད་དེ། གང་དགའ་བར་རྒྱུ་བར་བྱེད་དོ་ཞེས་བྱས་སོ། །
en: ‘Boys, look at Kāśyapa’s monks—roaming about like deer, no place to stay, just wandering off wherever they please!’

source: དེ་ནས་ཕྱི་ཞིག་ན་བྲམ་ཟེ་དེས། བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་དད་པ་རྙེད་ནས།
en: One day the brahmin and his five hundred disciples found faith in the doctrine of the Blessed One,

source: དེ་བྲམ་ཟེའི་ཁྱེའུ་དེ་དག་དང་ལྷན་ཅིག་ཏུ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་ཐད་དུ་རབ་ཏུ་བྱུང་ངོ་། །
en: and he and his five hundred disciples went forth in the presence of the totally and completely awakened Buddha Kāśyapa.

source: དེ་དག་དེར་རབ་ཏུ་བྱུང་ནས་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ན་ཡང་།
en: “Having gone forth, they practiced pure conduct all their lives,

source: ཡོན་ཏན་གྱི་ཚོགས་ཅི་ཡང་མ་ཐོབ་ནས། དེ་དག་གིས་འཆི་ཀར་སྨོན་ལམ་བཏབ་པ།
en: and while they may not have attained any great virtues, at the time of their deaths they prayed,

source: འདི་ལྟར་བདག་ཅག་གིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས། ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ཀྱང་ཡོན་ཏན་གྱི་ཚོགས་ཅི་ཡང་མ་ཐོབ་ཀྱིས།
en: ‘While we may not have attained any great virtues, still we have gone forth like this in the doctrine of the totally and completely awakened Buddha Kāśyapa and practiced the holy life all our lives.

source: དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱེད་པར་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: and manifest arhatship.’

source: དེའི་ཚེ་དགེ་སློང་ལྔ་བརྒྱར་གྱུར་པ་གང་ཡིན་པ་དེ་དག་ནི་རི་དགས་ཀྱི་བརྟུལ་ཞུགས་ཅན་འདི་དག་ཁོ་ན་ཡིན་ཏེ།
en: Those who were the five hundred monks then are none other than these Mṛgavratins.

source: དེ་རྣམས་ཀྱིས་དེར་དགེ་སློང་རྣམས་ལ་ཚིག་རྩུབ་པོ་སྨྲས་ཏེ། འདི་དག་ནི་རི་དགས་བཞིན་དུ་རྒྱུའོ་ཞེས་བྱས་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས། ཚེ་རབས་ལྔ་བརྒྱར་རི་དགས་སུ་སྐྱེས་ནས།
en: The act of speaking harshly to the monks and calling them a bunch of deer ripened such that for five hundred lifetimes they took rebirth as deer.

source: ད་ལྟར་སྲིད་པ་ཐ་མ་དང་། གནས་ཐ་མར་གྱུར་པའི་བར་དུ་ཡང་རི་དགས་ཀྱི་ཆ་ལུགས་འཛིན་པར་གྱུར་ཏོ། །
en: Now they are in their final existence, and until reaching this final state they continued to adopt the mannerisms of deer.

source: དེ་རྣམས་ཀྱིས་དེར་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ནས། འཆི་ཀར་སྨོན་ལམ་བཏབ་སྟེ།
en: “At that time they practiced pure conduct all their lives, and at the time of their deaths they prayed,

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས། བྲམ་ཟེའི་ཁྱེའུ་བླ་མ་ལུང་བསྟན་པ་གང་ཡིན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་བདག་ཅག་གིས་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག །
en: ‘May we please and not displease Uttara, the young brahmin prophesied by the totally and completely awakened Buddha Kāśyapa to be the next blessed buddha.

source: དེ་ཁོ་ནའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས། ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱེད་པར་གྱུར་ཅིག་ཅེས་བྱས་པ་དེས་ན།
en: May we go forth in his doctrine, cast away all afflictive emotions, and manifest arhatship.’

source: དགེ་སློང་དག་ང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་དང་། ཤིན་ཏུ་མཉམ་པ་དང་། ཤུགས་མཉམ་པ་དང་། མཛད་པ་མཉམ་པ་དང་། ཐབས་མཉམ་པ་བརྙེས་པར་གྱུར་ནས།
en: “So it is, monks, now that I myself have become the very equal of the totally and completely awakened Buddha Kāśyapa—equal in strength, equal in deeds, and equal in skillful means—

source: འདི་རྣམས་ཀྱིས་ང་མཉེས་པར་བྱས་ཏེ། མི་མཉེས་པར་མ་བྱས་ལ།
en: that they have pleased me, not displeased me,

source: ང་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས།
en: gone forth in my very doctrine,

source: ཟླ་བ་ཞེས་བྱ་བ་ནི།
en: The Story of Candrā

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེའི་ཚེ་མཉན་དུ་ཡོད་པ་ན་བྲམ་ཟེ་ཆེ་ཞིང་མཐོ་བ་ཟླ་བ་བདེ་བ་ཞེས་བྱ་བ་ཞིག་གནས་ཏེ།
en: When the Blessed One was in Śrāvastī there lived a certain great, high brahmin named Candrasukha.

source: དེ་དེ་དང་ལྷན་ཅིག་ཏུ་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་པ་ལས། ཕྱི་ཞིག་ན་དེའི་ཆུང་མ་ལ་བུ་མོ་ཆགས་ནས། དེ་ལ་ཡིད་ལ་འདོད་པ་འདི་ལྟ་བུ་ཞིག་སྐྱེས་ཏེ།
en: As they enjoyed themselves and coupled, one day his wife conceived, and the impulse arose in her,

source: གཞུང་གི་རྩོད་པ་རྣམས་དང་། ལྷན་ཅིག་ཏུ་གཏམ་ཟེར་ཡང་ཅི་མ་རུང་སྙམ་མོ། །
en: “Wouldn’t it be nice if I could debate the advocates of the different philosophical schools!”

source: དེ་ནས་དེས་ཁྱིམ་ཐབ་ལ་བསྙད་དེ།
en: She told her husband,

source: ཇོ་བོ་བདག་ལ་ཡིད་ལ་འདོད་པ་འདི་ལྟ་བུ་ཞིག་སྐྱེས་ཏེ།
en: “Lord, I’m having certain impulses—thinking things like,

source: བདག་གཞུང་གི་རྩོད་པ་རྣམས་དང་ལྷན་ཅིག་ཏུ་གཏམ་ཟེར་ཡང་ཅི་མ་རུང་སྙམ་བགྱིད་དོ་ཞེས་བྱས་སོ། །
en: ‘Wouldn’t it be nice if I could debate the advocates of the different philosophical schools!’ ”

source: བྲམ་ཟེ་དེ་ཡང་ལྟས་ལ་མཁས་པ་ཞིག་སྟེ། དེའི་བློ་སྐྱེས་པ་འདི་ནི་ལྟོ་ན་འདུག་པའི་སེམས་ཅན་དེའི་མཐུ་ཡིན་ཏེ། དེས་ན་དེའི་ཡིད་ལ་འདོད་པ་དེ་ལྟ་བུ་སྐྱེས་སོ་སྙམ་མོ། །
en: The brahmin was skilled in the interpretation of signs, and the idea came to him that it was on account of the being in her womb that she had such impulses.

source: དེ་ནས་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་། བུ་མོ་གཟུགས་བཟང་བ། བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཞིག་བཙས་ཏེ།
en: After nine or ten months had passed, she gave birth to a child who was well proportioned, pleasing to the eye, and beautiful.

source: དེ་ནས་བུ་མོ་འདི་ཟླ་བ་བདེ་བའི་བུ་མོ་ཡིན་པས་ན། བུ་མོ་འདིའི་མིང་ཟླ་བ་ཞེས་གདགས་སོ་ཞེས་ཟེར་རོ། །
en: “Since this is Candrasukha’s child, her name will be Candrā.”

source: དེ་ནས་བུ་མོ་ཟླ་བ་འོ་མ་དང་། ཞོ་དང་། མར་དང་། ཞུན་མར་དང་། མར་གྱི་ཉིང་གུས་བསྐྱེད་བསྲིངས་ཏེ།
en: They reared young Candrā on milk, yogurt, butter, ghee, and milk solids,

source: མཚོའི་ནང་གི་པད་མ་བཞིན་དུ་སྐྱེ་དྲག་པར་གྱུར་ནས།
en: and she flourished like a lotus in a lake.

source: གང་གི་ཚེ་དེ་ཆེན་མོར་གྱུར་པ་དེའི་ཚེ། ཁྱིམ་དེ་ཉིད་དུ་ཡི་གེ་བསླབས་ཏེ།
en: As she grew up, they educated her in letters there at home.

source: དེ་རིང་པོ་མ་ལོན་པར་ཡི་གེ་མཐར་ཕྱིན་ནས།
en: Before long she mastered her letters,

source: དེས་ཁྱིམ་དེ་ཉིད་དུ་ཕ་ལས་བསྟན་བཅོས་ཐམས་ཅད་ལོབས་ཏེ།
en: and there in the house she learned all of the scriptures from her father.

source: གཞུང་གི་རྩོད་པ་ཐམས་ཅད་ཚར་བཅད་ནས་དེས་ཚིག་ཏུ་བྱ་བ་ཐོས་སོ་ཅོག་ལོབས་སོ། །
en: She went on to defeat the advocates of the different philosophical schools and to master all the verses that she studied.

source: དེ་ནས་ཕྱི་ཞིག་ན་དེས་མཉན་དུ་ཡོད་པ་འདི་ཉིད་ན་དགེ་སྦྱོང་གཽ་ཏ་མ་ཐམས་ཅད་མཁྱེན་པ་ཐམས་ཅད་གཟིགས་པ་ཡིན་པར་བདག་ཉིད་ཁས་འཆེ་བ་ཞིག་ཡོད་དོ་ཞེས་ཐོས་ནས།
en: One day she heard that there was a certain ascetic in Śrāvastī named Gautama who claimed to be omniscient and all-seeing.

source: ཐོས་མ་ཐག་ཏུ་བུ་མོ་དེ་ཡང་ཡ་མཚན་དུ་གྱུར་ཏེ།
en: When she heard this, she was immediately filled with wonder, and thought,

source: བདག་སོང་ལ་དགེ་སྦྱོང་གཽ་ཏ་མ་དེ་ཇི་འདྲ་བ་བལྟ་བར་བྱའོ་སྙམ་སྟེ།
en: “I will go and see what the ascetic Gautama is really like.”

source: ཕ་མ་གཉིས་ལ་གསོལ་ནས། རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་དུ་སོང་སྟེ།
en: She asked for her parents’ permission and traveled to the garden of Prince Jeta,

source: བུ་མོ་དེས་ཐག་རིང་པོ་ཞིག་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་སྐུ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་ལེགས་པར་བརྒྱན་ཅིང་སྤ་བར་བྱས་པ། མེ་ལུས་ཀྱི་དབྱིབས་སུ་འདུག་པ་ལྟ་བུ།
en: where she saw the Blessed Buddha from a distance. His body, graced and resplendent with the thirty-two signs of a great person, looked like it was on fire,

source: མེ་ལྕེ་མར་གྱིས་བཏབ་པ་ལྟ་བུ།
en: like flames stoked with ghee,

source: མར་མེ་གསེར་གྱི་སྣོད་དུ་བཞག་པ་ལྟ་བུ།
en: like a lamp set in a golden vessel,

source: མཆོད་སྡོང་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་སྤྲས་པ་ལྟ་བུ།
en: and like a pillar adorned with all manner of jewels.

source: བཅོམ་ལྡན་འདས་ག་ལ་བཞུགས་པ་དེར་སོང་སྟེ་
en: Full of such joy she approached the Blessed One,

source: ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ཆོས་མཉན་པའི་ཕྱིར་སྤྱན་སྔར་འཁོད་དོ། །
en: and upon her arrival she touched her head to the Blessed One’s feet and sat before him to listen to the Dharma.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་བསམ་པ་དང་། བག་ལ་ཉལ་དང་། ཁམས་དང་། ཤེས་པ་དང་། རང་བཞིན་ཐུགས་སུ་ཆུད་ནས། དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ།
en: The Blessed One directly apprehended her thoughts, habitual tendencies, temperament, capacity, and nature, taught her the Dharma accordingly.

source: དེས་ན་བུ་མོ་ཟླ་བས་སྟན་དེ་ཉིད་ལ་འདུག་བཞིན་དུ་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་མཐོན་པོ་ཉི་ཤུ་ཡེ་ཤེས་རྡོ་རྗེས་བཅོམ་ནས། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ།
en: Hearing it, the woman destroyed with the thunderbolt of wisdom the twenty high peaks of the mountain of views concerning the transitory collection, and manifested the resultant state of stream entry right where she sat.

source: དེས་བདེན་པ་མཐོང་ནས་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: After she saw the truths, she rose from her seat, drew down the right shoulder of her upper garment, bowed toward the Blessed One with palms pressed together, and requested,

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་རབ་ཏུ་འབྱུང་བ་དང་བསྙེན་པར་རྫོགས་ཤིང་དགེ་སློང་མའི་དངོས་པོ་འཐོབ་ཏུ་རུང་ན།
en: “Blessed One, if permitted I wish to go forth in the Dharma and Vinaya so well spoken, complete my novitiate, and achieve full ordination.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐྱེ་དགུའི་བདག་མོ་ཆེན་མོ་གཽ་ཏ་མཱི་ལ་གཏད་ནས།
en: The Blessed One presented her to Mahā­prajāpatī Gautamī,

source: སྐྱེ་དགུའི་བདག་མོ་ཆེན་མོ་གཽ་ཏ་མཱིས་དེ་རབ་ཏུ་ཕྱུང་ནས།
en: and Mahā­prajāpatī Gautamī led her to go forth as a novice,

source: བསྙེན་པར་རྫོགས་པར་བྱས་ནས་དེ་ལ་ལུང་ཡང་ཕོག་གོ། །
en: conferred on her full ordination, and instructed her.

source: དེས་ཀྱང་བརྩོན་པ་དང་། བསྒྲུབ་པ་དང་། འབད་པས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ།
en: She cast away all afflictive emotions through diligence, practice, and effort,

source: དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ། །
en: and manifested arhatship.

source: དེར་གང་གི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ།
en: At that time the Blessed One spoke to the monks, saying,

source: དགེ་སློང་མ་རྣམས་ཀྱིས་ལས་ལ་འདུ་བ་ལོགས་ཞིག་ཏུ་གྱིས་ཤིག་ཅེས་གསུངས་པ་ལས།
en: “The nuns should meet together separately for their formal acts.”

source: སྐྱེ་དགུའི་བདག་མོ་ཆེན་མོ་གཽ་ཏ་མཱིས་སོ་སོར་ཐར་པའི་མདོ་འདོན་མི་ནུས་ནསདེ་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: Since Mahā­prajāpatī Gautamī was unable to recite the Prātimokṣa Sūtra, she went to see the Blessed One.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །
en: Upon her arrival she touched her head to the Blessed One’s feet and took a seat at one side.

source: ཕྱོགས་གཅིག་ཏུ་འདུག་ནས། བཅོམ་ལྡན་འདས་ལ་སྐྱེ་དགུའི་བདག་མོ་ཆེན་མོ་གཽ་ཏ་མཱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Once she had taken a seat at one side, Mahā­prajāpatī Gautamī beseeched the Blessed One,

source: བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་རྣམས་ཀྱིས་ཀྱང་ལས་ཀྱི་འདུ་བ་ལོགས་ཤིག་ཏུ་གྱིས་ཤིག །ད
en: “The Blessed One has stated that the monks should meet separately for their formal acts,

source: གེ་སློང་མ་རྣམས་ཀྱིས་ཀྱང་ལས་ཀྱི་འདུ་བ་ལོགས་ཤིག་ཏུ་གྱིས་ཤིག །
en: and that the nuns should also meet separately for their formal acts.

source: ཅེས་བཀའ་སྩལ་ལ། བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་རྣམས་ལ་ནི་སོ་སོར་ཐར་པ་བསྟན། དགེ་སློང་མ་རྣམས་ལ་ནི་མ་བསྟན་ལགས་ན།
en: Having said this, the Blessed One has taught the Prātimokṣa Sūtra to the monks, but has not taught it to the nuns.

source: བཅོམ་ལྡན་འདས་ཀྱིས་སོ་སོར་ཐར་པ་བསྟན་དུ་གསོལ། བཅོམ་ལྡན་འདས་བདག་གིས་གཟུང་བར་འཚལ་ལགས་སོ། །
en: If the Blessed One teaches the Prātimokṣa Sūtra to the nuns, Blessed One, I shall seek to grasp it.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་ཚིག་རེ་རེ་ནས་ཟློས་ཤིང་ཆོས་གསུངས་མི་སྲིད་དེ། དེའི་སྐབས་མེད་དོ། །
en: It is impossible for the blessed buddhas to explain each word as they teach the Dharma, for there’s not enough time.”

source: དེ་ནས་དེར་བཅོམ་ལྡན་འདས་ཀྱིས་སྐྱེ་དགུའི་བདག་མོ་ཆེན་མོ་གཽ་ཏ་མཱི་ལ་བཀའ་སྩལ་པ།
en: The Blessed One replied to Mahā­prajāpatī Gautamī,

source: ཀྱེ་གཽ་ཏ་མཱི་གལ་ཏེ་ལན་ཅིག་སྨྲས་པས་འཛིན་ནུས་ན་ནི་བསྟན་པར་བྱའོ་ཞེས་གསུངས་སོ། །
en: “Gautamī, if it can be grasped after I have spoken it just one time, then I shall teach it.”

source: དེ་ནས་དེའི་ཚེ་དགེ་སློང་མ་ཟླ་བ་འཁོར་དེ་ཉིད་དུ་འདུས་ཏེ།
en: At that time the nun Candrā was there in the assembly.

source: དགེ་སློང་མ་ཟླ་བས་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས།
en: She drew down the right shoulder of her upper garment,

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས།
en: bowed toward the Blessed One with palms pressed together,

source: བཅོམ་ལྡན་འདས་ཀྱིས་སོ་སོར་ཐར་པ་བསྟན་དུ་གསོལ།
en: “Blessed One, please teach the Prātimokṣa Sūtra .

source: ལན་ཅིག་བཀའ་སྩལ་པས། བདག་གིས་གཟུང་བར་འཚལ་ལོ། །
en: If it is spoken but one time I can grasp it.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་མ་རྣམས་ལ་སོ་སོར་ཐར་པའི་མདོ་བསྟན་ཏེ།
en: Thereupon the Blessed One taught the Prātimokṣa Sūtra to the nuns.

source: ལན་ཅིག་བཀའ་སྩལ་པས། དགེ་སློང་མ་ཟླ་བས་ལོབས་ནས། དེས་སྡེ་སྣོད་གསུམ་ཡང་ལོབས་སོ། །
en: Though it was spoken only once, the nun Candrā mastered it and thereupon she also mastered the Tripiṭaka.

source: ཚིག་ཏུ་བྱ་བ་ཅི་ཡང་རུང་བ་དེ་དག་ཐམས་ཅད་ཀྱང་ཐོས་མ་ཐག་ཏུ་ལོབས་ནས། བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ཐོས་པ་འཛིན་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་ཏོ། །
en: Because she had learned all the verses immediately upon hearing them, she was commended by the Blessed One as foremost among keepers of the teachings.

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ། བཙུན་པ་དགེ་སློང་མ་ཟླ་བས་ལས་ཅི་བགྱིས་ན། ལས་དེའི་རྣམ་པར་སྨིན་པས་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་རིགས་སུ་སྐྱེས་ལ།
en: “Lord,” the monks inquired of the Blessed Buddha, “what action did the nun Candrā take that ripened into her birth into a family of great means, prosperity, and wealth,

source: འདིས་བསྟན་བཅོས་ཐམས་ཅད་ཀྱང་ལོབས་ཏེ། གཞུང་གི་རྩོད་པ་ཐམས་ཅད་ཚར་བཅད་ནས།
en: and that having learned all the scriptures and defeated in debate the advocates of all the different philosophical schools,

source: འདིས་བཅོམ་ལྡན་འདས་ཀྱང་མཉེས་པར་བགྱིས་ཏེ། མི་མཉེས་པར་མ་བགྱིས་ལ་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས། ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བགྱིས་ལ།
en: she pleased the Blessed One, did not displease him, went forth in the doctrine of the Blessed One, cast away all afflictive emotions, manifested arhatship,

source: འདིས་ཐོས་པ་ཐམས་ཅད་ཀྱང་འཛིན་ནུས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་ཐོས་པ་འཛིན་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་ལགས།
en: and was able to grasp all the teachings such that the Blessed One commended her as foremost among keepers of the teachings?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པ་ན་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི། ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ
en: “Monks,” the Blessed One recounted, “in times past, in this fortunate eon, when people lived as long as twenty thousand years and the tathāgata, the arhat, the totally and completely awakened buddha possessed of insight and perfect conduct, the sugata, the knower of the world, the tamer of persons, the charioteer, the unsurpassed one, the teacher of humans and gods, the blessed buddha known as Kāśyapa was in the world,

source: དེའི་གསུང་རབ་ལ་འདི་རབ་ཏུ་བྱུང་ངོ་། །
en: there was a certain woman who went forth in his teaching.

source: དེ་གང་ལས་རབ་ཏུ་བྱུང་བར་གྱུར་པའི་མཁན་མོ་དེ། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་ཐོས་པ་འཛིན་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་ཏོ། །
en: The totally and completely awakened Buddha Kāśyapa had commended the preceptor who led her to go forth as foremost among keepers of the teachings.

source: དེ་ནས་དེས་དེར་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ནས། འཆི་ཀར་སྨོན་ལམ་བཏབ་པ།
en: “After practicing pure conduct all her life, at the time of her death she prayed,

source: ཇི་ལྟར་བདག་གི་མཁན་མོ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་ཐོས་པ་འཛིན་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་པ་དེ་བཞིན་དུ་བདག་ཀྱང་ཤཱཀྱ་ཐུབ་པ། ཤཱཀྱའི་རྒྱལ་པོ་དེས་ཐོས་པ་འཛིན་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་པར་ཤོག་ཅིག་ཅེས་བྱས་སོ། །
en: Just as the totally and completely awakened Buddha Kāśyapa commended my preceptor as foremost among keepers of the teachings, may the peerless Śākyamuni, King of the Śākyas, commend me as foremost among keepers of the teachings as well.’

source: དགེ་སློང་དག་ཇི་སྙམ་དུ་སེམས། དེའི་ཚེ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་གསུང་རབ་ལ་རབ་ཏུ་བྱུང་བའི་དགེ་སློང་མར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི། དགེ་སློང་མ་ཟླ་བ་འདི་ཁོ་ན་ཡིན་ཏེ
en: “O monks, what do you think? The one who went forth as a nun in the teaching of the totally and completely awakened Buddha Kāśyapa then is none other than the nun Candrā.
